app/views/admin/items/edit.html.erb

SELECT "genres".* FROM "genres"
---
        <%= f.label :genre_id, "ジャンル" %>
        <%= f.collection_select(:genre_id, Genre.all, :id, :name, include_blank: "選択してください")%>