app/views/admin/items/new.html.erb

        <%= f.label :genre_id, "ジャンル" %>
        <%= f.collection_select(:genre_id, Genre.all, :id, :name, include_blank: "選択してください")%>
---
SELECT "genres".* FROM "genres"