app/controllers/admin/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @customers = Customer.all

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cutomer = Customer.find(params[:id])