app/controllers/admin/genres_controller.rb

  def index
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def edit
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    genre = Genre.find(params[:id])
    genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "df"], ["updated_at", "2021-10-27 11:07:34.124285"], ["id", 1]]

  def create
    @genre = Genre.new(genre_params)
    @genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "dfaf"], ["created_at", "2021-10-27 09:42:36.924380"], ["updated_at", "2021-10-27 09:42:36.924380"]]