app/controllers/admin/items_controller.rb

  def index
    @items = Item.all
---
SELECT "items".* FROM "items"

   def create
     @item = Item.new(item_params)
     if @item.save!
---
INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @item = Item.find(params[:id])
    @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "genre_id" = ?, "price" = ?, "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["genre_id", 2], ["price", 1500], ["image_id", "251070bffd88ddbce9bb450fba89892501b609f3ce8531d9280ac738d799"], ["updated_at", "2021-10-30 05:19:33.756701"], ["id", 1]]