app/views/admin/homes/top.html.erb

SELECT "orders".* FROM "orders"
---
              <% @sum = 0 %>
              <% order.order_details.each do |order_detail| %>