app/controllers/public/addresses_controller.rb

SELECT "addresses"."id" FROM "addresses"
---
 def index
   @addresses = Address.all

INSERT INTO "addresses" ("name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["postal_code", "3400017"], ["address", "test"], ["created_at", "2021-12-06 17:17:31.015794"], ["updated_at", "2021-12-06 17:17:31.015794"]]
---
 def create
   @address = Address.new(address_params)
   @address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
 def edit
   @address = Address.find(params[:id])