app/controllers/public/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items"
---
 def index
  @cart_items = CartItem.all