app/controllers/public/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 def show
  @customer = Customer.find(params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 def edit
  @customer = Customer.find(params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "first_name_kana" = ?, "last_name_kana" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["first_name_kana", "タクヤ"], ["last_name_kana", "サクライ"], ["updated_at", "2021-11-23 12:04:20.333778"], ["id", 1]]
---
 def update
  @customer = Customer.find(params[:id])
  @customer.update(customer_params)