app/controllers/public/homes_controller.rb

SELECT "items".* FROM "items"
---
  def top
    @items = Item.all