app/controllers/public/items_controller.rb

  def index
   @items = Item.all
---
SELECT "items".* FROM "items"

  def show
   @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]